var arr = [1, 2, 3, 4, 5];
console.log(arr.map(x => x * 2));  // Logs: [2, 4, 6, 8, 10]
console.log(arr.filter(x => x > 2));  // Logs: [3, 4, 5]



// JavaScript содержит большое количество встроенных функций,
// включая математические (Math),
// для работы со строками (String), 
// числами (Number), массивами (Array), 
// объектами (Object), датами (Date) и др.


// В этом примере мы используем две встроенные функции массива: map, 
// которая создает новый массив, 
// преобразуя каждый элемент исходного массива с помощью предоставленной функции, 
// и filter, которая создает новый массив, 
// включая только те элементы, 
// для которых предоставленная функция возвращает true.